/*******************************************************************
	************************************************************
	*
	*@file     bsp_key.c
	*@author   Bin
	*@data     2017.02
	*@brief    按键驱动模块
	*
	*************************************************************
*********************************************************************/
#include "bsp_key.h"

uchar dis_type = 0 ; 
uchar max_safe_number = 75 ; 
uchar min_safe_number = 25 ;

/****************************************************************************************
	*@brief		按键检测函数
	*@param		无
	*@retvel	无
*****************************************************************************************/
uchar key_check() 
{
	uchar temp = 0x00 ;
	uint i ; 
	if( KEY!=0xff )					//检测按键是否按下
	{
		for(i=0;i<10;i--) ; 		//按键消抖
		if( KEY!=0xff )
		{
			temp = KEY ;			//保存按键状态值
			while( KEY!=0xff ) ;    //等待按键松开
		}
	}
	return temp; 					//返回按键状态值
}

/****************************************************************************************
	*@brief		通过按键来更新显示类型的状态位
	*@param		无
	*@retvel	无
*****************************************************************************************/
uchar status_deal(uchar temp)
{
	uchar status ;
	status = temp ; 
	if(status == 0xfe)        	//检测到显示切换按键按下
	{
		dis_type++ ; 			//显示类型改变
		if(dis_type==3)			//显示类型只有三种情况
		{
			dis_type = 0 ;
		}
	}
	return dis_type ;			//返回显示类型标志
}

/****************************************************************************************
	*@brief		通过按键来进行安全温度上下限的设置
	*@param		无
	*@retvel	无
*****************************************************************************************/
void safe_temp_set(uchar temp)
{
	uchar status ;
	status = temp ; 
	if((status == 0xfd)&&((dis_type==1)||(dis_type==2))) 	//显示类型是最高最低安全温度，温度设置加
	{
		if(dis_type==1)										//显示类型是最高安全温度
		{
			max_safe_number++ ; 							//按键按一次温度值加1
			if(max_safe_number == 128)						//安全温度最高设置值
			{
				max_safe_number = 128 ;
			}
		}
		if(dis_type==2)										//显示类型是最低安全温度
		{
			min_safe_number++ ; 							//按键按一次温度值减一
			if(min_safe_number == 128)
			{
				min_safe_number = 128 ;
			}
		}
	}
	
	else if((status == 0xfb)&&((dis_type==1)||(dis_type==2))) 	//显示类型是最高最低安全温度，温度设置减
	{
		if(dis_type==1)											//显示类型是最高最低安全温度，温度设置减
		{
			max_safe_number-- ; 								//按键按一次温度值减1
			if(max_safe_number == 0)
			{
				max_safe_number = 0;							//安全温度最低设置值
			}
		}
		if(dis_type==2)											//显示类型是最高最低安全温度，温度设置减
		{
			min_safe_number-- ; 								//按键按一次温度值减1
			if(min_safe_number == 0)
			{
				min_safe_number = 0 ;
			}
		}	
	}
}


